confirmations = [
    "да",
    "конечно",
    "ага",
    "угу",
    "хорошо",
    "ладно",
    "окей",
    "верно",
    "точно",
    "правильно",
    "подтверждаю",
    "так и есть",
    "сделай",
    "можно",
    "пусть будет"
]

rejections = [
    "нет",
    "не надо",
    "не сейчас",
    "отмена",
    "стоп",
    "не нужно",
    "откажись",
    "лучше не стоит",
    "потом",
    "не соглашусь",
    "не хочу",
    "ни за что",
    "не совсем",
    "не особо",
]

uncertain = [
    "может быть",
    "посмотрим",
    "не уверен",
    "не уверена",
    "не знаю",
    "возможно",
    "подумаю",
    "как хочешь",
    "как считаешь нужным",
    "пока не решил",
    "пока не решила"
]

