from num2words import num2words
from word2number import w2n


def num2word(number) -> str:  # Преобразовать число в строку
    word = num2words(number, lang="ru")
    return word


def word2num(word: str) -> int:
    try:
        number = w2n.word_to_num(word)
    except ValueError:
        raise ValueError(f"Не удалось преобразовать слово '{word}' в число.")
    return number


numerals_dict = {
    "1": "первое",
    "2": "второе",
    "3": "третье",
    "4": "четвёртое",
    "5": "пятое",
    "6": "шестое",
    "7": "седьмое",
    "8": "восьмое",
    "9": "девятое",
    "10": "десятое",
    "11": "одиннадцатое",
    "12": "двенадцатое",
    "13": "тринадцатое",
    "14": "четырнадцатое",
    "15": "пятнадцатое",
    "16": "шестнадцатое",
    "17": "семнадцатое",
    "18": "восемнадцатое",
    "19": "девятнадцатое",
    "20": "двадцатое",
    "21": "двадцать первое",
    "22": "двадцать второе",
    "23": "двадцать третье",
    "24": "двадцать четвёртое",
    "25": "двадцать пятое",
    "26": "двадцать шестое",
    "27": "двадцать седьмое",
    "28": "двадцать восьмое",
    "29": "двадцать девятое",
    "30": "тридцатое",
    "31": "тридцать первое"
}