
fractions = {
    "четверть": 0.25, "четверти": 0.25,
    "треть": 0.333, "трети": 0.333,
    "третья часть": 0.333, "четвертая часть": 0.25,
    "одна треть": 0.333, "одна четверть": 0.25,
}


half = {"половина": 0.5, "половины": 0.5, "половиной": 0.5,
        "половинку": 0.5, "наполовину": 0.5}

multipliers = {
    "тысяча": 1000,
    "тысяч": 1000,
    "тысячи": 1000,
    "миллион": 1000000,
    "миллиона": 1000000,
    "миллионов": 1000000,
    "миллиард": 1000000000,
    "миллиарда": 1000000000,
    "миллиардов": 1000000000,
}
